content/posts/2023/01/28/20230128.md
+++
title = """
  Fix "cannot open" error messages when using dash-docs
  """
author = ["Pieter Swinkels"]
date = 2023-01-28
slug = """
  fix-"cannot-open"-error-messages-when-using-dash-docs
  """
draft = false
+++

Haha, initially this note described a fix I made for an issue in [helm-dash](https://github.com/dash-docs-el/helm-dash) and
that I created a pull request to get it merged upstream. However, while writing
this note I realized I implemented the wrong approach and that I had to close
the pull request unmerged. Let's describe the problem first.


## The problem {#the-problem}

In [my note]({{< relref "20230116" >}}) about helm-dash, an Emacs package to access offline documentation
provided by [Dash](https://kapeli.com/dash), I mentioned the `*dash-docs-error*` buffer opens with messages
like this:

```text
cannot open: "''"

cannot open: "''"

cannot open: "''"

cannot open: "''"
----------------
 HEY! This is dash-docs (sqlite) error logging. If you want to disable it, set `dash-docs-enable-debugging` to nil
----------------
```

Some googling lead me to [this thread](https://sqlite.org/forum/forumpost/577873aa57777b91) on the SQLite forum about a change in
behavior of command-line option `--init`[^fn:1]. For SQLite versions older than
3.34.0, you would pass `-init ""`. But starting with 3.34.0, SQLite will report
the error that file `""` doesn't exist. To avoit that error message, you need to
pass the null device instead. The helm-dash package still passes `-init ""` and
hence the error messages.


## The pull request {#the-pull-request}

I developed a fix to the underlying Emacs package [dash-docs](https://github.com/dash-docs-el/dash-docs/pull/18) to pass the right
`-init` option depending on the SQLite version. In one of the last commits,
while adding docstrings, I had the fleeting thought "would it also work if I use
the null-device for older versions of SQLite?". If so, it would allow me to
remove a lot of the new code. "Nah, let's finish the documentation and we can
have a look at this later..."

As I prepared my pull request, I noticed the repo already had an [unmerged and
closed pull request](https://github.com/dash-docs-el/dash-docs/pull/11) that addressed the same problem. Its implementation always
passed the null device regardless of SQLite version :). "I should really test
whether that works for older SQLite versions", but I created [the GitHub pull
request](https://github.com/dash-docs-el/dash-docs/pull/18) anyway.


## Re-evaluating the pull request {#re-evaluating-the-pull-request}

The thought that passing the null-device also for older versions of SQLite would
also work didn't let me go. To be honest, it would make my pull request
hopelessly over-engineered. So I downloaded [SQLite 3.30.0](https://www.sqlite.org/2020/sqlite-tools-linux-x86-3330000.zip), modified the code to
always pass the null-device, tested it and... it worked! The first thing I did
was [close the pull request](https://github.com/dash-docs-el/dash-docs/pull/18#issuecomment-1407438486).


## Re-evaluating the process {#re-evaluating-the-process}

That was slightly embarrassing. My 100-line pull request (including
documentation and unit tests) could be replaced by a one-liner. Could I have
avoided the unnecessary work? I think so... the development &amp; release process
behind SQLite doesn't strike me as one that introduces a breaking change only
via a one-line entry in its release notes. And I did have "that fleeting
thought", albeit at a late stage during development and I didn't act on it.


## And upstream? {#and-upstream}

I already had my doubts whether my pull request would have been picked up as the
[dash-docs-el organization on GitHub](https://github.com/dash-docs-el/helm-dash) is light on activity. The dash-docs repo has
[an issue](https://github.com/dash-docs-el/dash-docs/issues/17) from 22 July 2022 that mentions the error message, and which didn't get
a reaction from the maintainer. The unmerged and closed pull request that
addressed the issue even precedes it. Then there's issue [helm-dash#201](https://github.com/dash-docs-el/helm-dash/issues/201), "(Read
before posting) Project unmaintained?". Its first comment states:

> Some metrics (as of Jun '22):
>
> -   Last project commit is 3y ago.
> -   21 open issues (oldest from 2015), with support (non-feature) requests
>     unanswered since 3y ago.
> -   8 open PR (oldest from 2016), incl. 4 without any review dating 4y ago

This means I'll fix my fork of dash-docs and install that forked version
instead.

[^fn:1]: The [SQLite Release History page](https://www.sqlite.org/changes.html) briefly mentions this change in behavior
    in the release notes for version 3.34.0.
